tutorials/compressible/rhoCentralFoam/LadenburgJet60psi/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       2320;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       2330;
    }
    freestreamInlet
    {
        type            patch;
        nFaces          10;
        startFace       2350;
    }
    freestream
    {
        type            patch;
        nFaces          60;
        startFace       2360;
    }
    wedge1
    {
        type            wedge;
        nFaces          1200;
        startFace       2420;
    }
    wedge2
    {
        type            wedge;
        nFaces          1200;
        startFace       3620;
    }
    defaultFaces
    {
        type            empty;
        nFaces          0;
        startFace       4820;
    }
)

// ************************************************************************* //
